node {
  name: "Track1_Input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2049
        }
      }
    }
  }
}
node {
  name: "Encoder_Input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 2049
        }
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\010\000\000\000\001\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.05101996660232544
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.05101996660232544
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense1/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 2049
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense1/kernel"
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense1/kernel"
}
node {
  name: "Encoder_Dense1/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense1/kernel"
  input: "Encoder_Dense1/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense1/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 256
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense1/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense1/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense1/bias"
    }
  }
}
node {
  name: "Encoder_Dense1/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense1/bias"
}
node {
  name: "Encoder_Dense1/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense1/bias"
  input: "Encoder_Dense1/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense1/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense1/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/MatMul"
  op: "MatMul"
  input: "Encoder_Input"
  input: "Encoder_Dense1/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense1/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense1/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense1/MatMul"
  input: "Encoder_Dense1/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_LeakyRelu1/LeakyRelu"
  op: "LeakyRelu"
  input: "Encoder_Dense1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\001\000\000\200\000\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.125
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.125
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense2/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense2/kernel"
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense2/kernel"
}
node {
  name: "Encoder_Dense2/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense2/kernel"
  input: "Encoder_Dense2/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense2/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 128
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense2/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense2/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense2/bias"
    }
  }
}
node {
  name: "Encoder_Dense2/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense2/bias"
}
node {
  name: "Encoder_Dense2/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense2/bias"
  input: "Encoder_Dense2/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense2/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense2/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/MatMul"
  op: "MatMul"
  input: "Encoder_LeakyRelu1/LeakyRelu"
  input: "Encoder_Dense2/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense2/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense2/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense2/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense2/MatMul"
  input: "Encoder_Dense2/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_LeakyRelu2/LeakyRelu"
  op: "LeakyRelu"
  input: "Encoder_Dense2/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\200\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1767766922712326
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1767766922712326
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense3/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 128
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense3/kernel"
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense3/kernel"
}
node {
  name: "Encoder_Dense3/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense3/kernel"
  input: "Encoder_Dense3/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense3/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense3/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense3/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense3/bias"
    }
  }
}
node {
  name: "Encoder_Dense3/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense3/bias"
}
node {
  name: "Encoder_Dense3/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense3/bias"
  input: "Encoder_Dense3/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense3/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense3/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/MatMul"
  op: "MatMul"
  input: "Encoder_LeakyRelu2/LeakyRelu"
  input: "Encoder_Dense3/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense3/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense3/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense3/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense3/MatMul"
  input: "Encoder_Dense3/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_LeakyRelu3/LeakyRelu"
  op: "LeakyRelu"
  input: "Encoder_Dense3/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.25
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.25
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense4/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense4/kernel"
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense4/kernel"
}
node {
  name: "Encoder_Dense4/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense4/kernel"
  input: "Encoder_Dense4/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense4/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense4/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense4/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense4/bias"
    }
  }
}
node {
  name: "Encoder_Dense4/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense4/bias"
}
node {
  name: "Encoder_Dense4/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense4/bias"
  input: "Encoder_Dense4/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense4/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense4/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/MatMul"
  op: "MatMul"
  input: "Encoder_LeakyRelu3/LeakyRelu"
  input: "Encoder_Dense4/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense4/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense4/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense4/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense4/MatMul"
  input: "Encoder_Dense4/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_LeakyRelu4/LeakyRelu"
  op: "LeakyRelu"
  input: "Encoder_Dense4/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.3535533845424652
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.3535533845424652
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense5/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense5/kernel"
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense5/kernel"
}
node {
  name: "Encoder_Dense5/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense5/kernel"
  input: "Encoder_Dense5/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense5/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense5/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense5/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense5/bias"
    }
  }
}
node {
  name: "Encoder_Dense5/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense5/bias"
}
node {
  name: "Encoder_Dense5/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense5/bias"
  input: "Encoder_Dense5/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense5/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense5/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/MatMul"
  op: "MatMul"
  input: "Encoder_LeakyRelu4/LeakyRelu"
  input: "Encoder_Dense5/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense5/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense5/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense5/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense5/MatMul"
  input: "Encoder_Dense5/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_LeakyRelu5/LeakyRelu"
  op: "LeakyRelu"
  input: "Encoder_Dense5/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "alpha"
    value {
      f: 0.10000000149011612
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\n\000\000\000"
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.4803844690322876
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.4803844690322876
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/max"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/RandomUniform"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/mul"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
}
node {
  name: "Encoder_Dense7/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense7/kernel"
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense7/kernel"
}
node {
  name: "Encoder_Dense7/kernel/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense7/kernel"
  input: "Encoder_Dense7/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense7/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 10
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Encoder_Dense7/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Encoder_Dense7/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Encoder_Dense7/bias"
    }
  }
}
node {
  name: "Encoder_Dense7/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Encoder_Dense7/bias"
}
node {
  name: "Encoder_Dense7/bias/Assign"
  op: "AssignVariableOp"
  input: "Encoder_Dense7/bias"
  input: "Encoder_Dense7/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense7/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense7/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/MatMul"
  op: "MatMul"
  input: "Encoder_LeakyRelu5/LeakyRelu"
  input: "Encoder_Dense7/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Encoder_Dense7/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Encoder_Dense7/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Encoder_Dense7/BiasAdd"
  op: "BiasAdd"
  input: "Encoder_Dense7/MatMul"
  input: "Encoder_Dense7/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Encoder_Dense7/Sigmoid"
  op: "Sigmoid"
  input: "Encoder_Dense7/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Latent_Input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 10
        }
      }
    }
  }
}
node {
  name: "Decoder_Input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 10
        }
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\n\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.4803844690322876
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.4803844690322876
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/max"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/RandomUniform"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/mul"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
}
node {
  name: "Decoder_Dense1/kernel"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/kernel"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 10
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Decoder_Dense1/kernel"
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Decoder_Dense1/kernel"
}
node {
  name: "Decoder_Dense1/kernel/Assign"
  op: "AssignVariableOp"
  input: "Decoder_Dense1/kernel"
  input: "Decoder_Dense1/kernel/Initializer/random_uniform"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Decoder_Dense1/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/bias/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/bias"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "Decoder_Dense1/bias"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Decoder_Dense1/bias"
      }
    }
  }
  attr {
    key: "allowed_devices"
    value {
      list {
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Decoder_Dense1/bias"
    }
  }
}
node {
  name: "Decoder_Dense1/bias/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Decoder_Dense1/bias"
}
node {
  name: "Decoder_Dense1/bias/Assign"
  op: "AssignVariableOp"
  input: "Decoder_Dense1/bias"
  input: "Decoder_Dense1/bias/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/bias/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Decoder_Dense1/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/MatMul/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Decoder_Dense1/kernel"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/MatMul"
  op: "MatMul"
  input: "Decoder_Input"
  input: "Decoder_Dense1/MatMul/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "Decoder_Dense1/BiasAdd/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Decoder_Dense1/bias"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Decoder_Dense1/BiasAdd"
  op: "BiasAdd"
  input: "Decoder_Dense1/MatMul"
  input: "Decoder_Dense1/BiasAdd/ReadVariableOp"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "Decoder_LeakyRelu1/LeakyRelu"
  op: "LeakyRelu"
  input: "Decoder_Dense1/BiasAdd"
  attr {
